
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前端基础 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2-HTML超文本标记语言.html" />
    
    
    <link rel="prev" href="0-认识前端.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    第一章 基础篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="0-认识前端.html">
            
                <a href="0-认识前端.html">
            
                    
                    初识前端
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.2" data-path="1-前端基础.html">
            
                <a href="1-前端基础.html">
            
                    
                    前端基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="2-HTML超文本标记语言.html">
            
                <a href="2-HTML超文本标记语言.html">
            
                    
                    HTML基础
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >前端基础</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x524D;&#x7AEF;&#x57FA;&#x7840;">&#x524D;&#x7AEF;&#x57FA;&#x7840;</h3>
<blockquote>
<p>&#x5982;&#x4ECA;&#x524D;&#x7AEF;&#x7684;&#x6280;&#x672F;&#x66F4;&#x65B0;&#x901F;&#x5EA6;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#xFF0C;&#x4E0E;&#x5176;&#x8BF4;&#x66F4;&#x65B0;&#x901F;&#x5EA6;&#x4E0D;&#x5982;&#x8BF4;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#x7684;&#x8FB9;&#x754C;&#x4E0D;&#x65AD;&#x88AB;&#x62D3;&#x5BBD;&#x3002;&#x4ECE;&#x6700;&#x521D;&#x7684;PC&#x7AEF;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#xFF0C;&#x518D;&#x7136;&#x540E;&#x662F;&#x5404;&#x79CD;&#x7EC8;&#x7AEF;&#x3002;WEB&#x524D;&#x7AEF;&#x5DF2;&#x7ECF;&#x4ECE;&#x6700;&#x521D;&#x7684;&#x4FE1;&#x606F;&#x5C55;&#x793A;&#xFF0C;&#x53D1;&#x5C55;&#x6210;&#x4E3A;&#x4E0E;&#x7528;&#x6237;&#x5173;&#x7CFB;&#x65E5;&#x76CA;&#x5BC6;&#x5207;&#x7684;&#x5E94;&#x7528;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x4E14;&#x4E0E;&#x7528;&#x6237;&#x7684;&#x5173;&#x7CFB;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5BC6;&#x5207;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x4ECA;&#x524D;&#x7AEF;&#x7684;&#x706B;&#x7206;&#x7A0B;&#x5EA6;&#x8D85;&#x51FA;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x60F3;&#x8C61;&#xFF0C;&#x660E;&#x660E;&#x7B80;&#x5355;&#x7684;&#x5F00;&#x53D1;&#x4E2A;&#x9875;&#x9762;&#x800C;&#x5DF2;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5E02;&#x9762;&#x4E0A;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#x3002;&#x5176;&#x5B9E;&#x9694;&#x884C;&#x5982;&#x9694;&#x5C71;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7AD9;&#x5728;&#x95E8;&#x5916;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x95E8;&#x5185;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x3002;&#x524D;&#x7AEF;&#x4E4B;&#x6240;&#x4EE5;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x88AB;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x9AD8;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x8FD9;&#x70B9;&#x8981;&#x611F;&#x8C22;&#x4E54;&#x5E2E;&#x4E3B;&#xFF0C;&#x6CA1;&#x6709;&#x4ED6;&#x6216;&#x8BB8;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8FD8;&#x5728;&#x5728;&#x585E;&#x73ED;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x4E3E;&#x6B65;&#x7EF4;&#x8270;&#x3002;&#x800C;&#x4E0E;&#x7528;&#x6237;&#x76F4;&#x63A5;&#x53D1;&#x751F;&#x4EA4;&#x4E92;&#x884C;&#x4E3A;&#x7684;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#x624D;&#x8FBE;&#x5230;&#x4E86;&#x8BA9;&#x4EBA;&#x77A0;&#x76EE;&#x7ED3;&#x820C;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#x524D;&#x7AEF;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#x4F9D;&#x65E7;&#x6CA1;&#x6709;&#x53D8;&#x3002;&#x7EC4;&#x6210;&#x524D;&#x7AEF;&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x7684;&#x8BED;&#x8A00;&#x4ECD;&#x7136;&#x662F;HTML&#xFF0C;CSS&#xFF0C;Javascript&#x4E09;&#x95E8;&#x8BED;&#x8A00;&#x3002;</p>
<h4 id="html&#x2014;&#x2014;&#x8D85;&#x6587;&#x672C;&#x6807;&#x8BB0;&#x8BED;&#x8A00;">HTML&#x2014;&#x2014;&#x8D85;&#x6587;&#x672C;&#x6807;&#x8BB0;&#x8BED;&#x8A00;</h4>
<p>HTML&#x4F5C;&#x4E3A;&#x524D;&#x7AEF;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x5B9E;&#x9645;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x547D;&#x540D;&#x5B9E;&#x9645;&#x6307;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x6587;&#x672C;&#x6DFB;&#x52A0;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x8BB0;&#xFF08;&#x6807;&#x7B7E;&#x5143;&#x7D20;&#xFF09;&#x8BA9;&#x9875;&#x9762;&#x5177;&#x5907;&#x53EF;&#x89C6;&#x5316;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x94FE;&#x63A5;&#x5176;&#x4ED6;&#x6587;&#x6863;&#x7684;&#x529F;&#x80FD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9488;&#x5BF9;HTML&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x53EA;&#x8981;&#x719F;&#x7EC3;&#x5730;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x89C4;&#x5219;&#xFF0C;&#x5E76;&#x4E14;&#x7A0D;&#x52A0;&#x8FD0;&#x7528;&#x5C31;&#x80FD;&#x9A6C;&#x4E0A;&#x638C;&#x63E1;&#x548C;&#x5B9E;&#x8DF5;&#x3002;&#x800C;&#x4E14;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x4EFB;&#x4F55;&#x903B;&#x8F91;&#x57FA;&#x7840;&#xFF0C;&#x5B8C;&#x5168;&#x662F;&#x7ED3;&#x6784;&#x6027;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;</p>
<h4 id="css&#x2014;&#x2014;&#x5C42;&#x53E0;&#x6837;&#x5F0F;&#x8868;">CSS&#x2014;&#x2014;&#x5C42;&#x53E0;&#x6837;&#x5F0F;&#x8868;</h4>
<p>&#x867D;&#x7136;&#x5F00;&#x53D1;&#x591A;&#x5E74;&#x4F46;&#x662F;&#x5BF9;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53D1;&#x8A00;&#x6743;&#xFF0C;&#x8BE5;&#x8BED;&#x8A00;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;HTML&#x6807;&#x8BB0;&#xFF08;&#x6807;&#x7B7E;&#x5143;&#x7D20;&#xFF09;&#x81C3;&#x80BF;&#x7684;&#x95EE;&#x9898;&#x800C;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x771F;&#x7684;&#x5F88;&#x68D2;&#x3002;CSS&#x7684;&#x6838;&#x5FC3;&#x662F;&#x5BF9;&#x6587;&#x6863;&#x6D41;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;HTML&#x6587;&#x6863;&#x7684;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#xFF0C;&#x5F15;&#x5165;&#x6587;&#x6863;&#x6D41;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5C06;&#x539F;&#x672C;&#x81C3;&#x80BF;&#x7684;&#x6807;&#x7B7E;&#x901A;&#x8FC7;&#x7075;&#x6D3B;&#x7684;&#x9009;&#x62E9;&#x5668;&#x4FEE;&#x6539;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7684;&#x662F;<strong>&#x6587;&#x6863;&#x6D41;&#x7684;&#x5B9A;&#x4E49;</strong>&#xFF0C;<strong>&#x5143;&#x7D20;&#x76D2;&#x6A21;&#x578B;</strong>&#xFF0C;&#x4EE5;&#x53CA;<strong>&#x6587;&#x6863;&#x6D41;&#x7684;&#x7834;&#x574F;&#x548C;&#x4FEE;&#x6539;</strong>&#x3002;</p>
<h4 id="javascript&#x2014;&#x2014;&#x5D4C;&#x5165;&#x5F0F;&#x811A;&#x672C;&#x8BED;&#x8A00;">Javascript&#x2014;&#x2014;&#x5D4C;&#x5165;&#x5F0F;&#x811A;&#x672C;&#x8BED;&#x8A00;</h4>
<p>&#x6700;&#x521D;&#x7531;&#x4E8E;Javascript&#x662F;&#x8FD0;&#x884C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5E38;&#x5E38;&#x88AB;&#x4EBA;&#x79F0;&#x4E3A;&#x5D4C;&#x5165;&#x5F0F;&#x811A;&#x672C;&#xFF0C;&#x4F46;&#x662F;&#x4F9D;&#x7136;&#x6CA1;&#x6709;&#x5F71;&#x54CD;Javascript&#x6210;&#x4E3A;&#x4E00;&#x95E8;&#x5F3A;&#x5927;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x8BE5;&#x8BED;&#x8A00;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x662F;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x7684;&#x54CD;&#x5E94;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;&#x4E8B;&#x4EF6;&#xFF0C;&#x54CD;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7ED3;&#x679C;&#x3002;&#x8BE5;&#x8BED;&#x8A00;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x91CD;&#x70B9;&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x90FD;&#x9700;&#x8981;Javascript&#x53BB;&#x5B9E;&#x73B0;&#x3002;&#x8BE5;&#x8BED;&#x8A00;&#x6B63;&#x5728;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5B8C;&#x5584;&#xFF0C;&#x5E76;&#x4E14;&#x9010;&#x6E10;&#x5411;&#x9759;&#x6001;&#x5316;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x3002;</p>
<ol>
<li><p>&#x5E93;</p>
<p>&#x5E93;&#x662F;&#x9488;&#x5BF9;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x7C7B;&#xFF0C;&#x4F8B;&#x5982;&#x9488;&#x5BF9;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x573A;&#x666F;&#x7684;&#x5C01;&#x88C5;&#x5B9E;&#x73B0;&#xFF0C;&#x79F0;&#x4E3A;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x7C7B;&#x5E93;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x6B64;&#x3002;</p>
</li>
<li><p>&#x6846;&#x67B6;</p>
<p>&#x6846;&#x67B6;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x66F4;&#x591A;&#x95EE;&#x9898;&#x7684;&#x5C01;&#x88C5;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;jQuery&#x6846;&#x67B6;&#x662F;&#x5B9E;&#x73B0;Javascript&#x5728;PC&#x7AEF;&#x6D4F;&#x89C8;&#x5668;API&#x517C;&#x5BB9;&#x6027;&#x7684;&#x6846;&#x67B6;&#xFF08;Zepto&#x9488;&#x5BF9;&#x79FB;&#x52A8;&#x7AEF;&#xFF09;&#xFF0C;MVVM&#x6846;&#x67B6;&#x662F;&#x4E3A;&#x4E86;&#x5FEB;&#x901F;&#x6784;&#x5EFA;&#x754C;&#x9762;&#x7684;&#x5C01;&#x88C5;&#x5B9E;&#x73B0;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;DOM&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#xFF0C;&#x51CF;&#x5C11;&#x624B;&#x52A8;DOM&#x64CD;&#x4F5C;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5B9E;&#x73B0;&#x3002;</p>
</li>
</ol>
<h4 id="&#x5C0F;&#x7ED3;">&#x5C0F;&#x7ED3;</h4>
<p>&#x4EE5;&#x4E0A;&#x9488;&#x5BF9;&#x524D;&#x7AEF;&#x57FA;&#x7840;&#x8FDB;&#x884C;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x9610;&#x8FF0;&#xFF0C;&#x65E0;&#x8BBA;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x5982;&#x4F55;&#x53D1;&#x5C55;&#x57FA;&#x7840;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x56F4;&#x7ED5;&#x8FD9;&#x4E09;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x5BF9;&#x57FA;&#x7840;&#x7684;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x4F1A;&#x8BA9;&#x540E;&#x9762;&#x7684;&#x8DEF;&#x66F4;&#x52A0;&#x5F00;&#x9614;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x4E09;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x5177;&#x4F53;&#x7EC6;&#x8282;&#x5185;&#x5BB9;&#xFF0C;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x4E2D;&#x9646;&#x7EED;&#x66F4;&#x65B0;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="0-认识前端.html" class="navigation navigation-prev " aria-label="Previous page: 初识前端">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2-HTML超文本标记语言.html" class="navigation navigation-next " aria-label="Next page: HTML基础">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前端基础","level":"2.1.2","depth":2,"next":{"title":"HTML基础","level":"2.1.3","depth":2,"path":"第一章 基础篇/2-HTML超文本标记语言.md","ref":"第一章 基础篇/2-HTML超文本标记语言.md","articles":[]},"previous":{"title":"初识前端","level":"2.1.1","depth":2,"path":"第一章 基础篇/0-认识前端.md","ref":"第一章 基础篇/0-认识前端.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"第一章 基础篇/1-前端基础.md","mtime":"2019-06-16T09:16:51.150Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-06-19T15:40:44.406Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

